[
  {
    "title": "1",
    "order": "1",
    "rank": "10",
    "image": "GriffeyTop10_10.jpg",
    "overlay": "left",
    "name": "The Debut",
    "subhead": "",
    "chatter": "Griffey didn’t make Seattle fans wait long to see what all the fuss was about, smashing the first pitch he saw at the Kingdome on April 10, 1989 for a home run off Eric King of the Chicago White Sox.\r\n\r\n",
    "youtube": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/apple-cup-by-the-numbers-pac-12s-top-passing-offense-meets-pac-12s-top-defense/",
    "linktext": "&raquo; Nation's top passing offense meets Pac-12’s top defense\n",
    "poll": "\n"
  },
  {
    "title": "2",
    "order": "2",
    "rank": "9",
    "image": "GriffeyTop10_09.jpg",
    "overlay": "right",
    "name": "The Return",
    "subhead": "",
    "chatter": "When Griffey returned to the Mariners in 2009, many worried that it might tarnish the legacy created in his first go-round with the team. Griffey, though, quickly eased those worries when he hit a home run at Minnesota on opening day to tie Frank Robinson for the most opening-day home runs in major-league history (if only that had been his last opening day with the Mariners).\r\n\r\n",
    "youtube": "",
    "credit": "Rod Mar / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-huskies/huskies-1991-flashback-tommie-smiths-interception-in-apple-cup-sealed-big-win/",
    "linktext": "&raquo; Huskies 1991 flashback: Tommie Smith’s interception in Apple Cup seals big win\n",
    "poll": ""
  },
  {
    "title": "3",
    "order": "3",
    "rank": "8",
    "image": "GriffeyTop10_08.jpg",
    "overlay": "left",
    "name": "The Opening Day Bash",
    "subhead": "",
    "chatter": "As noted above, Griffey liked opening days, and he began his greatest season as a Mariner in 1997 with two home runs off David Cone of the Yankees on his way to 56 for the year and a unanimous MVP award.\r\n\r\n\n\n",
    "youtube": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/wsu-cougar-football/remembering-cougarsrsquo-improbable-victory-in-2012-apple-cup/",
    "linktext": "&raquo; Remembering Cougars’ improbable victory in 2012 Apple Cup",
    "poll": ""
  },
  {
    "title": "4",
    "order": "4",
    "rank": "7",
    "image": "GriffeyTop10_07.jpg",
    "overlay": "left",
    "name": "The Visit",
    "subhead": "",
    "chatter": "We’re going to slightly cheat and put one Cincinnati moment on this list — Griffey’s return to Seattle with the Reds for an interleague series in 2007. Griffey admitted he was a little nervous about the reception he’d get. He shouldn’t have been as he was wildly cheered at every turn and responded with a turn-back-the-clock performance when he hit two home runs in the last game of the series on June 24, 2007.\r\n\r\n",
    "youtube": "",
    "credit": "Harley Soltes / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "5",
    "order": "5",
    "rank": "6",
    "image": "GriffeyTop10_06.jpg",
    "overlay": "right",
    "name": "The Kingdown Finale",
    "subhead": "",
    "chatter": "Griffey was the first player to really make the Kingdome come alive as a baseball stadium, and he did little to hide his sadness at seeing it go away. He bid it a fitting farewell, making a highlight-reel catch to rob Juan Gonzalez of a home run, and hitting home run in the last game ever played in the Kingdome (also the last home run hit there) as the Mariners beat the Texas Rangers on June 27, 1999.\r\n\r\n",
    "youtube": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "6",
    "order": "6",
    "rank": "5",
    "image": "GriffeyTop10_05.jpg",
    "overlay": "left",
    "name": "The Catch",
    "subhead": "",
    "chatter": "It’s hard to pick a top defensive gem. But if forced to we’ll go with another early defining moment — his leap over the wall at Yankee Stadium to rob Jesse Barfield of a home run on April 26, 1990. Just as memorable was his wide smile and mad dash with the ball into the dugout, a display of exuberance that defined his early years as “The Kid.”\r\n\r\n",
    "youtube": "",
    "credit": "Barry Wong / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "7",
    "order": "7",
    "rank": "4",
    "image": "GriffeyTop10_04.jpg",
    "overlay": "right",
    "name": "The Ignitor",
    "subhead": "",
    "chatter": "There were only 17,592 at the Kingdome on a sleepy Aug. 24 afternoon to see what proved to be the beginning of the team’s magical run to the 1995 ALCS, a comeback 9-7 win over the Yankees clinched when Griffey hit a two-run walk-off homer off John Wetteland. It was the first walk-off homer of Griffey’s career and sparked the rally that saw Seattle overtake the Angels in the West.",
    "youtube": "",
    "credit": "Mark Harrison / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/apple-cup-cougars-score-in-final-minute-win-42-35/",
    "linktext": "&raquo; Cougars score in final minute, win Apple Cup 42-35",
    "poll": ""
  },
  {
    "title": "8",
    "order": "8",
    "rank": "3",
    "image": "GriffeyTop10_03.jpg",
    "overlay": "right",
    "name": "The Streak",
    "subhead": "",
    "chatter": "In Lou Piniella’s first year as manager in 1993, one of the first signs of the baseball turnaround in Seattle came when the city became gripped by Griffey’s streak of hitting home runs in eight straight games, tying the major-league record. Somewhat forgotten today is that the streak ended on July 29 in a game in which Griffey hit a double off the wall, narrowly missing breaking the record.\r\n\r",
    "youtube": "",
    "credit": "Rod Mar / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/apple-cup-history-high-scoring-games/",
    "linktext": "&raquo; Apple Cup history: High-scoring games\n",
    "poll": ""
  },
  {
    "title": "9",
    "order": "9",
    "rank": "2",
    "image": "GriffeyTop10_02.jpg",
    "overlay": "left",
    "name": "The Back-to-Back Griffey Jacks",
    "subhead": "",
    "chatter": "In a feat that may never be duplicated, Griffey and his father, Ken, hit home runs on consecutive at-bats in the first inning of a game against the Angels in Anaheim on Sept. 14, 1990 against pitcher Kirk McCaskill.\r\n",
    "youtube": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/ten-years-ago-huskies-won-a-wild-apple-cup-in-pullman/",
    "linktext": "&raquo; Huskies win wild Apple Cup in Pullman",
    "poll": ""
  },
  {
    "title": "10",
    "order": "10",
    "rank": "1",
    "image": "GriffeyTop10_01.jpg",
    "overlay": "right",
    "name": "The Slide",
    "subhead": "",
    "chatter": "For all of Griffey’s majestic home runs and circus catches, it’s a mad dash around the bases to score the winning run in the 1995 Division Series against the Yankees that stands as the most unforgettable play of his career — and Mariner history. In Dave Niehaus’ famous call of the play, he notes that third-base coach Sam Perlozzo (though unnamed by Niehaus) is waving Griffey in. Not that Griffey would have stopped, but if he had, it might have been left to a rookie named Alex Rodriguez, who was waiting on deck, to drive him in. That the play instead is remembered as the greatest moment for maybe the two greatest Mariners of all time — Edgar Martinez and Griffey — makes it a rare Mariner moment that turned out, and remains, perfect.",
    "youtube": "",
    "credit": "Vic Condiotty / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  }
]